public class Main {
    public static void main(String[] args) {
        int prise = 1000;
        int mile = 20;
        int sumMile = prise / mile;

        System.out.println("сумма миль:" + sumMile);

    }
}
// Объявляете переменные для входных данных и
// параметров программы: одну для хранения
// стоимости билета, другую для хранения количества
// рублей для одной бонусной милли

// Рассчитываете количество бонусных милль, используя
// значения заведённых переменных. Ответ сохраняете в
// новую переменную и выводите на экран